Tekla Open API Reference for Tekla Structures 2025
AlongLinePlacing Properties
The AlongLinePlacing type exposes the following members.
Properties
Name | Description
EndPoint
 The end point of the line that the object is placed on.
StartPoint
 The start point of the line that the object is placed on.
Top
See Also
Reference
AlongLinePlacing Class
Tekla.Structures.Drawing Namespace